// 4. Напишите программу, которая на вход принимает
//    натуральное число N, а на выходе показывает его
//    цифры через запятую.

int N = int.Parse(Console.ReadLine()!);

string = new string(num);
while (string == new string(num))
{ N


return 0;
}




while (play_again == "Y" or "y")
{ cout << "it worked!";
  cout << "Would you like to play again? (Y or N)";
  getline (cin, play_again);
  cout << play_again;
}

}

string = new string(num);


Console.WriteLine(a/100*10 + a%10);



Console.WriteLine(N);
Console.WriteLine(" , ");

