// 4. Напишите программу, которая на вход принимает
//    натуральное число N, а на выходе показывает его
//    цифры через запятую.

Console.WriteLine("Введите число");

int num = int.Parse(Console.ReadLine()!);

while (true)
{
    i = i + num % 10 + " , ";
    num /= 10;    
    
return 0;
}
    string == new string(num);
    Console.WriteLine(string);

