// 4. Напишите программу, которая на вход принимает
//    натуральное число N, а на выходе показывает его
//    цифры через запятую.

Console.WriteLine("Введите число");

int N = int.Parse(Console.ReadLine()!);

string (N) = new string(num);
while (string /(N) == new string(num))
{
    count << N % 10;
    Console.WriteLine(string);
    Console.WriteLine(" , ");
    
return 0;
}